-- MySQL dump 10.13  Distrib 8.0.36, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: pixel
-- ------------------------------------------------------
-- Server version	8.0.36

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `event`
--

DROP TABLE IF EXISTS `event`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `event` (
  `eventID` bigint NOT NULL AUTO_INCREMENT,
  `event_name` varchar(45) NOT NULL,
  `start_date` date DEFAULT NULL,
  `end_date` date DEFAULT NULL,
  `start_time` time DEFAULT NULL,
  `end_time` time DEFAULT NULL,
  `reminder` varchar(45) DEFAULT NULL,
  `notificationID` bigint NOT NULL,
  `description` varchar(245) NOT NULL,
  `created_by` bigint DEFAULT NULL,
  `created_at` datetime DEFAULT NULL,
  `updated_by` bigint DEFAULT NULL,
  `updated_at` datetime DEFAULT NULL,
  `event_typeid` bigint DEFAULT NULL,
  PRIMARY KEY (`eventID`),
  KEY `createdBy_event_idx` (`created_by`),
  KEY `updatedBy_event_idx` (`updated_by`),
  KEY `notification_event_idx` (`notificationID`),
  KEY `eventType_event_idx` (`event_typeid`)
) ENGINE=InnoDB AUTO_INCREMENT=1106 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `event`
--

LOCK TABLES `event` WRITE;
/*!40000 ALTER TABLE `event` DISABLE KEYS */;
INSERT INTO `event` VALUES (56,'Your Event Name','2024-03-21','2024-03-23','13:17:34','14:16:48','Your Reminder',2,'Your Event Description',1,'2024-03-21 12:00:00',1,'2024-03-21 12:00:00',7),(153,'تسليم مهمة إعداد لحملة test event','2024-03-26','2024-03-26','13:17:34','14:16:48',NULL,1657,'تسليم مهمة إعداد لحملة test event',NULL,'2024-03-26 16:23:14',NULL,NULL,1),(202,'اعتماد التصميم النهائي لحملة  cc','2024-03-24','2024-03-24','14:16:48','18:17:10',NULL,2752,'اعتماد التصميم النهائي لحملة  cc',NULL,'2024-04-01 14:41:54',NULL,NULL,4),(203,'اعتماد التصميم النهائي لحملة  cc','2024-03-24','2024-03-24','14:16:48','18:17:10',NULL,2753,'اعتماد التصميم النهائي لحملة  cc',NULL,'2024-04-01 14:47:15',NULL,NULL,4),(204,'اعتماد التصميم النهائي لحملة  cc','2024-03-24','2024-03-24','14:16:48','18:17:10',NULL,2754,'اعتماد التصميم النهائي لحملة  cc',NULL,'2024-04-01 14:48:18',NULL,NULL,4),(205,'اعتماد التصميم النهائي لحملة  cc','2024-03-24','2024-03-24','14:16:48','18:17:10',NULL,2755,'اعتماد التصميم النهائي لحملة  cc',NULL,'2024-04-01 14:48:43',NULL,NULL,4),(252,'تسليم مهمة إعداد لحملة rr','2024-04-02','2024-04-02','14:16:48','18:17:10',NULL,2804,'تسليم مهمة إعداد لحملة rr',NULL,'2024-04-02 13:52:58',NULL,NULL,1),(253,'تسليم مهمة إعداد لحملة ww','2024-04-02','2024-04-02','14:16:48','18:17:10',NULL,2816,'تسليم مهمة إعداد لحملة ww',NULL,'2024-04-02 14:13:39',NULL,NULL,1),(302,'تسليم مهمة إعداد لحملة khvkh','2024-04-02','2024-04-02','14:16:48','18:17:10',NULL,2904,'تسليم مهمة إعداد لحملة khvkh',NULL,'2024-04-02 14:31:38',NULL,NULL,1),(303,'تسليم مهمة إعداد لحملة wq','2024-04-02','2024-04-02','14:16:48','18:17:10',NULL,2909,'تسليم مهمة إعداد لحملة wq',NULL,'2024-04-02 14:39:04',NULL,NULL,1),(304,'تسليم مهمة إعداد لحملة fsv','2024-04-02','2024-04-02','14:16:48','18:17:10',NULL,2914,'تسليم مهمة إعداد لحملة fsv',NULL,'2024-04-02 14:39:55',NULL,NULL,1),(352,'تسليم مهمة إعداد لحملة cead','2024-04-02','2024-04-02','14:16:48','18:17:10',NULL,2954,'تسليم مهمة إعداد لحملة cead',NULL,'2024-04-02 14:47:02',NULL,NULL,1),(402,'تسليم مهمة إعداد لحملة css','2024-04-02','2024-04-02','14:16:48','18:17:10',NULL,3004,'تسليم مهمة إعداد لحملة css',NULL,'2024-04-02 14:51:43',NULL,NULL,1),(403,'تسليم مهمة إعداد لحملة eac','2024-04-02','2024-04-02','14:16:48','18:17:10',NULL,3009,'تسليم مهمة إعداد لحملة eac',NULL,'2024-04-02 14:56:12',NULL,NULL,1),(404,'تسليم مهمة تصميم لحملة eac','2024-04-02','2024-04-02','14:16:48','18:17:10',NULL,3014,'تسليم مهمة تصميم لحملة eac',NULL,'2024-04-02 16:01:06',NULL,NULL,2),(452,'تسليم مهمة إعداد لحملة غزة','2024-04-04','2024-04-04','14:16:48','18:17:10',NULL,3054,'تسليم مهمة إعداد لحملة غزة',NULL,'2024-04-04 13:03:41',NULL,NULL,1),(502,'تسليم مهمة تصميم لحملة test','2024-04-07','2024-04-07','14:16:48','18:17:10',NULL,3111,'تسليم مهمة تصميم لحملة test',NULL,'2024-04-07 11:01:31',NULL,NULL,2),(503,'تسليم مهمة تصوير لحملة test','2024-04-07','2024-04-07','14:16:48','18:17:10',NULL,3112,'تسليم مهمة تصوير لحملة test',NULL,'2024-04-07 11:01:31',NULL,NULL,3),(504,'تسليم مهمة مونتاج لحملة test','2024-04-07','2024-04-07','14:16:48','18:17:10',NULL,3113,'تسليم مهمة مونتاج لحملة test',NULL,'2024-04-07 11:01:31',NULL,NULL,4),(552,'تسليم مهمة تصميم لحملة طلوزة','2024-04-07','2024-04-07','14:16:48','18:17:10',NULL,3212,'تسليم مهمة تصميم لحملة طلوزة',NULL,'2024-04-07 15:20:33',NULL,NULL,2),(553,'تسليم مهمة تصوير لحملة طلوزة','2024-04-07','2024-04-07','14:16:48','18:17:10',NULL,3213,'تسليم مهمة تصوير لحملة طلوزة',NULL,'2024-04-07 15:20:33',NULL,NULL,3),(554,'تسليم مهمة مونتاج لحملة طلوزة','2024-04-07','2024-04-07','14:16:48','18:17:10',NULL,3214,'تسليم مهمة مونتاج لحملة طلوزة',NULL,'2024-04-07 15:20:33',NULL,NULL,4),(602,'تسليم مهمة تصميم لحملة رفح','2024-04-07','2024-04-07','14:16:48','18:17:10',NULL,3311,'تسليم مهمة تصميم لحملة رفح',NULL,'2024-04-07 16:34:22',NULL,NULL,2),(603,'تسليم مهمة تصوير لحملة رفح','2024-04-07','2024-04-07','14:16:48','18:17:10',NULL,3312,'تسليم مهمة تصوير لحملة رفح',NULL,'2024-04-07 16:34:22',NULL,NULL,3),(604,'تسليم مهمة مونتاج لحملة رفح','2024-04-07','2024-04-07','14:16:48','18:17:10',NULL,3313,'تسليم مهمة مونتاج لحملة رفح',NULL,'2024-04-07 16:34:22',NULL,NULL,4),(652,'تسليم مهمة تصميم لحملة عسقلان','2024-04-08','2024-04-08','14:16:48','18:17:10',NULL,3412,'تسليم مهمة تصميم لحملة عسقلان',NULL,'2024-04-08 14:01:37',NULL,NULL,2),(653,'تسليم مهمة تصوير لحملة عسقلان','2024-04-08','2024-04-08','14:16:48','18:17:10',NULL,3413,'تسليم مهمة تصوير لحملة عسقلان',NULL,'2024-04-08 14:01:37',NULL,NULL,3),(654,'تسليم مهمة مونتاج لحملة عسقلان','2024-04-08','2024-04-08','14:16:48','18:17:10',NULL,3414,'تسليم مهمة مونتاج لحملة عسقلان',NULL,'2024-04-08 14:01:37',NULL,NULL,4),(702,'تسليم مهمة تصميم لحملة نابلس','2024-04-08','2024-04-08','14:16:48','18:17:10',NULL,3461,'تسليم مهمة تصميم لحملة نابلس',NULL,'2024-04-08 17:07:26',NULL,NULL,2),(703,'تسليم مهمة تصوير لحملة نابلس','2024-04-08','2024-04-08','14:16:48','18:17:10',NULL,3462,'تسليم مهمة تصوير لحملة نابلس',NULL,'2024-04-08 17:07:26',NULL,NULL,3),(704,'تسليم مهمة مونتاج لحملة نابلس','2024-04-08','2024-04-08','14:16:48','18:17:10',NULL,3463,'تسليم مهمة مونتاج لحملة نابلس',NULL,'2024-04-08 17:07:27',NULL,NULL,4),(752,'تسليم مهمة إعداد لحملة nb','2024-04-16','2024-04-16','14:16:48','18:17:10',NULL,3654,'تسليم مهمة إعداد لحملة nb',NULL,'2024-04-16 11:09:20',NULL,NULL,1),(753,'تسليم مهمة تصميم لحملة nb','2024-04-16','2024-04-16','14:16:48','18:17:10',NULL,3659,'تسليم مهمة تصميم لحملة nb',NULL,'2024-04-16 11:09:34',NULL,NULL,2),(802,'تسليم مهمة تصميم لحملة test full','2024-04-16','2024-04-16','14:16:48','18:17:10',NULL,3711,'تسليم مهمة تصميم لحملة test full',NULL,'2024-04-16 11:32:38',NULL,NULL,2),(852,'تسليم مهمة إعداد لحملة srv','2024-04-16','2024-04-16','14:16:48','18:17:10',NULL,3755,'تسليم مهمة إعداد لحملة srv',NULL,'2024-04-16 13:04:14',NULL,NULL,1),(853,'تسليم مهمة تصميم لحملة srv','2024-04-16','2024-04-16','14:16:48','18:17:10',NULL,3760,'تسليم مهمة تصميم لحملة srv',NULL,'2024-04-16 13:05:06',NULL,NULL,2),(854,'تسليم مهمة إعداد لحملة test','2024-04-16','2024-04-16','14:16:48','18:17:10',NULL,3764,'تسليم مهمة إعداد لحملة test',NULL,'2024-04-16 13:09:33',NULL,NULL,1),(855,'تسليم مهمة تصميم لحملة test','2024-04-16','2024-04-16','14:16:48','18:17:10',NULL,3769,'تسليم مهمة تصميم لحملة test',NULL,'2024-04-16 13:10:29',NULL,NULL,2),(902,'تسليم مهمة إعداد لحملة rved','2024-04-16','2024-04-16','14:16:48','18:17:10',NULL,3804,'تسليم مهمة إعداد لحملة rved',NULL,'2024-04-16 14:05:16',NULL,NULL,1),(903,'تسليم مهمة تصميم لحملة rved','2024-04-16','2024-04-16','14:16:48','18:17:10',NULL,3809,'تسليم مهمة تصميم لحملة rved',NULL,'2024-04-16 14:05:51',NULL,NULL,2),(952,'تسليم مهمة إعداد لحملة cesdc','2024-04-16','2024-04-16','14:16:48','18:17:10',NULL,3855,'تسليم مهمة إعداد لحملة cesdc',NULL,'2024-04-16 14:08:07',NULL,NULL,1),(953,'تسليم مهمة تصميم لحملة cesdc','2024-04-16','2024-04-16','14:16:48','18:17:10',NULL,3860,'تسليم مهمة تصميم لحملة cesdc',NULL,'2024-04-16 14:08:37',NULL,NULL,2),(954,'تسليم مهمة إعداد لحملة lokijuhygt','2024-04-16','2024-04-16','14:16:48','18:17:10',NULL,3864,'تسليم مهمة إعداد لحملة lokijuhygt',NULL,'2024-04-16 14:09:14',NULL,NULL,1),(955,'تسليم مهمة تصميم لحملة lokijuhygt','2024-04-16','2024-04-16','14:16:48','18:17:10',NULL,3869,'تسليم مهمة تصميم لحملة lokijuhygt',NULL,'2024-04-16 14:09:23',NULL,NULL,2),(956,'تسليم مهمة تصميم لحملة kjhgfds','2024-04-16','2024-04-16','14:16:48','18:17:10',NULL,3880,'تسليم مهمة تصميم لحملة kjhgfds',NULL,'2024-04-16 14:11:46',NULL,NULL,2),(1002,'تسليم مهمة تصميم لحملة scs','2024-04-16','2024-04-16','14:16:48','18:17:10',NULL,3911,'تسليم مهمة تصميم لحملة scs',NULL,'2024-04-16 14:13:14',NULL,NULL,2),(1003,'تسليم مهمة إعداد لحملة  dc ','2024-04-16','2024-04-16','14:16:48','18:17:10',NULL,3915,'تسليم مهمة إعداد لحملة  dc ',NULL,'2024-04-16 14:14:09',NULL,NULL,1),(1004,'تسليم مهمة تصميم لحملة  dc ','2024-04-16','2024-04-16','14:16:48','18:17:10',NULL,3920,'تسليم مهمة تصميم لحملة  dc ',NULL,'2024-04-16 14:15:30',NULL,NULL,2),(1005,'تسليم مهمة إعداد لحملة dfv','2024-04-16','2024-04-16','14:16:48','18:17:10',NULL,3924,'تسليم مهمة إعداد لحملة dfv',NULL,'2024-04-16 14:33:51',NULL,NULL,1),(1006,'تسليم مهمة تصميم لحملة dfv','2024-04-16','2024-04-16','14:16:48','18:17:10',NULL,3929,'تسليم مهمة تصميم لحملة dfv',NULL,'2024-04-16 14:35:12',NULL,NULL,2),(1052,'test','2024-04-30','2024-04-30','15:22:00','17:22:00','',4002,'test',0,NULL,0,NULL,7),(1102,'تجربة الحدث','2024-05-09','2024-05-10','14:35:00','16:35:00','',4053,'تجربة الملاحظات',0,NULL,0,NULL,7),(1103,'رسيي','2024-05-15','2024-05-16','14:39:00','16:39:00','',4054,'سرير',0,NULL,0,NULL,7),(1104,'sjvbjdb','2024-06-22','2024-07-25','14:43:00','14:43:00','',4055,'teczh',0,NULL,0,NULL,7),(1105,'tsbf','2024-05-01','2024-05-16','14:45:00','14:45:00','',4056,'twst',0,NULL,0,NULL,7);
/*!40000 ALTER TABLE `event` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-05-04 22:12:35
